app/views/users/show.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 4]]
---
<ul>
<%= @user.playlists.each do |t|%>