app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def artist_selector
        @artist = Artist.find(params[:id])