app/controllers/playlists_controller.rb

    def index
        @user = User.find(session[:user_id])
        @playlists = Playlist.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists"

    def show
        @user = User.find(session[:user_id])
        @playlist = Playlist.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @playlist = Playlist.create(playlist_params)
        @playlist.user_id = find_user.id
        #binding.pry
        if @playlist.save
---
INSERT INTO "playlists" ("description", "song", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Lorem impsum description"], ["song", "{}"], ["created_at", "2020-12-19 18:53:45.164760"], ["updated_at", "2020-12-19 18:53:45.164760"]]
UPDATE "playlists" SET "user_id" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["user_id", 1], ["updated_at", "2021-05-17 15:25:36.210490"], ["id", 2]]

    def playlist_selector
        @playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def find_user
        User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]