app/controllers/sessions_controller.rb

  def create
    binding.pry
    #if auth #facebook login

        #@user.find_or_create_by(email: auth["info"]["email"]) do |u|
          #u.full_name = auth["info"]["name"]
          # Secure Random generates a secrue 10 digit hexadecimal string that will be encrypted by bcrypt
         # u.password = SecureRandom.hex(10)
        #end
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "technicallyaustin@gmail.com"], ["LIMIT", 1]]

  def login
    binding.pry
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]