app/controllers/songs_controller.rb

    def song_selector
        @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]