app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", "M83"], ["LIMIT", 1]]
---
    def create
       @song = Song.new(song_params)
       @song.artist_id = Artist.find_or_create_by(name: song_params[:artist_name])

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def song_selector
        @song = Song.find(params[:id])