app/controllers/users_controller.rb

    def create
        #binding.pry
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        user_selector
        @playlist = Playlist.find_or_create_by(title: params[:title])
        @song = Song.find_or_create_by(name: params[:name])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."title" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."name" IS NULL LIMIT ?  [["LIMIT", 1]]

    def user_selector
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]