app/views/playlists/index.html.erb

SELECT "playlists".* FROM "playlists"
---
<h1> Display all playlists here, with links to edit, and view individual playlists, deleting is done from the edit menu.  </h1>
<%=Playlist.all.select{|x|x.user_id == @user.id}%>